# GetExtrusionBase Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ExtrusionAnalyzer..::..GetExtrusionBase Method
ExtrusionAnalyzer Class See Also
---
Obtains the face that represents the base contour of the extrusion analysis.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2012
# Syntax
C#
---
```text
public Face GetExtrusionBase()
```

Visual Basic
---
```text
Public Function GetExtrusionBase As Face
```

Visual C++
---
```text
public:
Face^ GetExtrusionBase()
```

# ### Return Value
The face that represents the base contour.
# See Also
ExtrusionAnalyzer Class
Autodesk.Revit.DB Namespace